# Import Library
- `pandas` library

In [2]:
import pandas as pd

## `pandas.apply`

In [3]:
# Create DataFrame

df = pd.DataFrame([[4,9]]*3, columns=['A','B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [5]:
import numpy as np

df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [6]:
df.apply(np.sum, axis=0) # Vertical sum

A    12
B    27
dtype: int64

In [8]:
df.apply(np.sum, axis=1) # Horizontal sum

0    13
1    13
2    13
dtype: int64

In [9]:
# apply method 'lambda'

df.apply(lambda x: [1,2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

Passing `result_type='expand'` will expand list-like results to columns of a Dataframe

In [10]:
df.apply(lambda x: [1,2], axis=1, result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2

Returning a Series inside the function is similar to passing `result_type='expand'`. The resulting column names will be the Series index.

In [11]:
df.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)

   foo  bar
0    1    2
1    1    2
2    1    2